{"Bleach anime":{"content":"Bleach (stylized in all caps) is a Japanese anime television series based on Tite Kubo's original manga series of the same name. It was produced by Studio Pierrot and directed by Noriyuki Abe. The series aired on TV Tokyo from October 2004 to March 2012, spanning 366 episodes. The story follows the adventures of Ichigo Kurosaki after he obtains the powers of a Soul Reaper—a death personification similar to the Grim Reaper—from another Soul Reaper, Rukia Kuchiki. His newfound powers force him to take on the duties of defending humans from evil spirits and guiding departed souls to the afterlife. In addition to adapting the manga series it is based on, the anime periodically includes original self-contained storylines and characters not found in the source material.\nViz Media obtained foreign television and home video distribution rights to the Bleach anime in March 2006. Bleach was broadcast in the United States on Adult Swim from September 2006 to November 2014.\nBleach: Thousand-Year Blood War, a sequel series covering the manga's final story arc, also animated by Pierrot and directed by Tomohisa Taguchi, aired its first 13-episode cour on TV Tokyo from October to December 2022. The second 13-episode cour aired from July to September 2023. The third cour is set to premiere in 2024.","details":{"general":{"name":"Bleach","image":"Bleachanime.png","caption":["Yasutora Sado","Ichigo Kurosaki","Uryū Ishida"],"genre":["Adventure fiction"],"title":"Related works","content":["Bleach (manga)","Bleach: Memories of Nobody","Bleach: The DiamondDust Rebellion","Bleach: Fade to Black","Bleach: Hell Verse","Rock Musical Bleach","List of Bleach video games"]},"tvSeries":{"type":"tv series","title":"Bleach: Thousand-Year Blood War","director":["Tomohisa Taguchi","Mitsutoshi Satou."],"producer":["Makoto Hijikata","Tasuku Honda","Genki Negishi","Yoshihiro Tominaga"],"writer":["Tomohisa Taguchi","Masaki Hiramatsu"],"music":"Shirō Sagisu","studio":"Pierrot","licensee":["Viz Media","{{English anime licensee","SEA = Medialink"],"network":"TV Tokyo","first":"October 11, 2022","episodes":"26","episodeList":"Bleach: Thousand-Year Blood War"},"tables":[],"bsTables":null,"lists":[]}},"idk":{"content":"I Don't Know may refer to:","details":{"general":{},"tables":[],"bsTables":null,"lists":[]}},"Naruto":{"content":"Naruto is a Japanese manga series written and illustrated by Masashi Kishimoto. It tells the story of Naruto Uzumaki, a young ninja who seeks recognition from his peers and dreams of becoming the Hokage, the leader of his village. The story is told in two parts: the first is set in Naruto's pre-teen years (volumes 1–27), and the second in his teens (volumes 28–72). The series is based on two one-shot manga by Kishimoto: Karakuri (1995), which earned Kishimoto an honorable mention in Shueisha's monthly Hop Step Award the following year, and Naruto (1997).\nNaruto was serialized in Shueisha's shōnen manga magazine Weekly Shōnen Jump from September 1999 to November 2014, with its chapters collected in 72 tankōbon volumes. Part I of the manga was adapted into an anime television series by Pierrot and Aniplex, which ran for 220 episodes from October 2002 to February 2007 on TV Tokyo; the English dub of the series aired on Cartoon Network and YTV from September 2005 to December 2009. A second series, which adapts material from Part II of the manga, is titled Naruto: Shippuden and ran on TV Tokyo for 500 episodes from February 2007 to March 2017. The English dub of Shippuden was broadcast on Disney XD in the United States from October 2009 to November 2011, airing the first 98 episodes before eventually switching over to Adult Swim's Toonami programming block in January 2014, starting over from the first episode. After Disney XD removed the series from broadcast, Viz Media began streaming new English dubbed episodes on their streaming service Neon Alley in from December 2012 to March 2016, starting at episode 99 and ending at episode 338 due to the service's shutdown. Besides the anime television series, Pierrot also developed 11 animated films and 12 original video animations (OVAs). Other Naruto-related merchandise includes light novels, video games, and trading cards developed by several companies.\nViz Media licensed the manga and anime for North American production and serialized Naruto in their digital Weekly Shonen Jump magazine. The anime series began airing in the United States and Canada in 2005, and in the United Kingdom and Australia in 2006 and 2007, respectively. The films and most OVAs from the series were also released by Viz, with the first film premiering in movie theaters. The story of Naruto continues with Naruto's son, Boruto Uzumaki, in Boruto: Naruto Next Generations: Boruto wishes to create his own ninja way instead of following his father's.\nNaruto is one of the best-selling manga series in history having 250 million copies in circulation worldwide in 47 countries and regions, with 153 million copies in Japan alone and remaining 97 million copies elsewhere. It has become one of Viz Media's best-selling manga series; their English translations of the volumes have appeared on USA Today and The New York Times bestseller list several times, and the seventh volume won a Quill Award in 2006. Reviewers praised the manga's character development, storylines, and action sequences, though some felt the latter slowed the story down. Critics noted that the manga, which has a coming-of-age theme, makes use of cultural references from Japanese mythology and Confucianism.","details":{"general":{"image":"NarutoCoverTankobon1.jpg","alt":"Naruto Uzumaki doing a hand sign while there is a scroll in his mouth.","caption":"tankōbon","jaKanji":"ruby-ja","genre":["Adventure fiction","Fantasy comedy","Martial arts film"],"title":"Media franchise","content":"List of Naruto media#Films"},"manga":{"type":"manga","author":"Masashi Kishimoto","publisher":"Shueisha","publisherEn":"English manga publishers","aus":"Madman Entertainment","demographic":"Shōnen","magazine":"Weekly Shōnen Jump","magazineEn":"English manga magazine","na":["Weekly Shonen Jump (American magazine)","Shonen Jump (magazine)"],"imprint":"Jump Comics","first":"September 21, 1999","last":"November 10, 2014","volumes":"72","volumeList":"List of Naruto volumes"},"tables":[],"bsTables":null,"lists":[]}},"javascript":{"content":"JavaScript (), often abbreviated as JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2023, 98.7% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries. All major web browsers have a dedicated JavaScript engine to execute the code on users' devices.\nJavaScript is a high-level, often just-in-time compiled language that conforms to the ECMAScript standard. It has dynamic typing, prototype-based object-orientation, and first-class functions. It is multi-paradigm, supporting event-driven, functional, and imperative programming styles. It has application programming interfaces (APIs) for working with text, dates, regular expressions, standard data structures, and the Document Object Model (DOM).\nThe ECMAScript standard does not include any input/output (I/O), such as networking, storage, or graphics facilities. In practice, the web browser or other runtime system provides JavaScript APIs for I/O.\nJavaScript engines were originally used only in web browsers, but are now core components of some servers and a variety of applications. The most popular runtime system for this usage is Node.js.\nAlthough Java and JavaScript are similar in name, syntax, and respective standard libraries, the two languages are distinct and differ greatly in design.","details":{"general":{"name":"JavaScript","screenshot":"JavaScript code.png","screenshotCaption":"Screenshot of JavaScript source code","paradigm":["event-driven programming","functional programming","imperative programming","procedural programming","object-oriented programming"],"designer":"Brendan Eich","typing":["Dynamic typing","Weak typing","Duck typing"],"implementations":["V8 (JavaScript engine)","JavaScriptCore","SpiderMonkey (JavaScript engine)","Chakra (JScript engine)"],"influenced":["ActionScript","AssemblyScript","CoffeeScript","Dart (programming language)","Haxe","JS++","Opa (programming language)","TypeScript"],"fileExtensions":["<code>.js</code>","<code>.cjs</code>","<code>.mjs</code>"],"wikibooks":"JavaScript","year":{"date":"1995-12-04T00:00:00.000Z"},"latestReleaseVersion":"wikidata","latestReleaseDate":"start date and age","latestPreviewVersion":"wikidata","latestPreviewDate":"start date and age","influencedBy":"Java (programming language)","website":{"date":"0262-01-01T00:00:00.000Z"}},"tables":[],"bsTables":null,"lists":[]}},"Bankai":{"content":"This is a list of Soul Reapers (死神, Shinigami, literally, \"death gods\") featured in the manga and anime series Bleach, created by Tite Kubo. Soul Reapers are a fictional race of spirits who govern the flow of souls between the human world and the afterlife realm called the Soul Society.\nThe series tells of how Ichigo Kurosaki becomes a substitute Soul Reaper in Karakura Town in place of Rukia Kuchiki. He assumes her duties to protect souls and put them to peaceful rest, as well as to fight against dangerous, lost souls that could not rest, called hollows.\nAs the series progresses, however, Rukia is captured by the Soul Society's Soul Reaper military for giving her powers to Ichigo, and she is sentenced to death. Ichigo and his friends go to save her and are forced to fight against many of the Soul Society's Thirteen Court Guard Squads. Eventually, the fifth Squad Captain Sōsuke Aizen, the third Squad Captain Gin Ichimaru, and the ninth Squad Captain Kaname Tosen all defect from the Soul Society at the time of the rescue and start a plan, interrupting Ichigo's battles, to gain greater power with the arrancars, focusing the story with the main antagonist Sōsuke Aizen. In the final arc, the real one is Yhwach, the son of Soul King and father of Quincy.","details":{"general":{},"tables":[],"bsTables":null,"lists":[]}},"command":{"content":"Command may refer to:","details":{"general":{},"tables":[],"bsTables":null,"lists":[]}},"home":{"content":"A home, or domicile, is a space used as a permanent or semi-permanent residence for one or more human occupants, and sometimes various companion animals. It is a fully- or semi-sheltered space and can have both interior and exterior aspects to it. Homes provide sheltered spaces, for instance rooms, where domestic activity can be performed such as sleeping, preparing food, eating and hygiene as well as providing spaces for work and leisure such as remote working, studying and playing.\nPhysical forms of homes can be static such as a house or an apartment, mobile such as a houseboat, trailer or yurt or digital such as virtual space. The aspect of ‘home’ can be considered across scales; from the micro scale showcasing the most intimate spaces of the individual dwelling and direct surrounding area to the macro scale of the geographic area such as town, village, city, country or planet.\nThe concept of ‘home’ has been researched and theorized across disciplines – topics ranging from the idea of home, the interior, the psyche, liminal space, contested space to gender and politics. The home as a concept expands beyond residence as contemporary lifestyles and technological advances redefine the way the global population lives and works. The concept and experience encompasses the likes of exile, yearning, belonging, homesickness and homelessness.","details":{"general":{},"tables":[],"bsTables":null,"lists":[]}}}